/* *************************************************************************************** */
/* TASK 1. В базе данных shop и sample присутствуют одни и те же таблицы, учебной базы     */
/*         данных. Переместите запись id = 1 из таблицы shop.users в таблицу sample.users. */
/*         Используйте транзакции.                                                         */
/* *************************************************************************************** */

START TRANSACTION;
USE shop;
INSERT INTO sample.users (name, birthday_at, created_at, updated_at)
SELECT name, birthday_at, created_at, updated_at
FROM users
WHERE id = 1;
COMMIT;

/* *************************************************************************************** */
/* TASK 2. Создайте хранимую функцию hello(), которая будет возвращать приветствие,        */
/*         в зависимости от текущего времени суток. С 6:00 до 12:00 функция должна         */
/*         возвращать фразу "Доброе утро", с 12:00 до 18:00 функция должна возвращать      */
/*         фразу "Добрый день", с 18:00 до 00:00 — "Добрый вечер", с 00:00 до 6:00 —       */
/*         "Доброй ночи".                                                                  */
/* *************************************************************************************** */

USE shop;
CREATE OR REPLACE VIEW hello AS
SELECT CASE
           WHEN hour < 6 THEN 'Доброй ночи'
           WHEN hour >= 6 AND hour < 12 THEN 'Доброе утро'
           WHEN hour >= 12 AND hour < 18 THEN 'Добрый день'
           WHEN hour >= 18 THEN 'Добрый вечер'
           END
FROM (
         SELECT HOUR(NOW()) as hour
     ) t;
